Repository: moaiy-com/moaiy
Catalog: Moaiy/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, ja, ko, pt_br, ru, zh_hans

# yubikey_import_completion_complete_title
source: Public key completion succeeded
ar: نجح إكمال المفتاح العام
de: Die Vervollständigung des öffentlichen Schlüssels war erfolgreich
es: La clave pública se completó correctamente
fr: L'achèvement de la clé publique a réussi
hi: सार्वजनिक कुंजी पूर्ण करना सफल हुआ
ja: 公開鍵の完成に成功しました
ko: 공개키 완성 성공
pt_br: Conclusão da chave pública bem-sucedida
ru: Открытый ключ завершен успешно.
zh_hans: 公钥补全成功

# yubikey_import_completion_counts
source: %1$lld public keys completed · %2$lld still stub-only
ar: اكتملت المفاتيح العامة %1$lld · لا يزال %2$lld كعب روتين فقط
de: %1$lld öffentliche Schlüssel abgeschlossen · %2$lld immer noch Stub-Only
es: Claves públicas %1$lld completadas · %2$lld aún es solo código auxiliar
fr: Clés publiques %1$lld terminées · %2$lld est toujours un stub uniquement
hi: %1$lld सार्वजनिक कुंजियाँ पूर्ण हो गईं · %2$lld अभी भी केवल-स्टब-केवल
ja: %1$lld 公開鍵が完成しました · %2$lld はまだスタブのみです
ko: %1$lld 공개 키 완료 · %2$lld는 여전히 스텁 전용입니다.
pt_br: Chaves públicas %1$lld concluídas · %2$lld ainda apenas stub
ru: Открытые ключи %1$lld завершены · %2$lld все еще остается только заглушкой
zh_hans: 已补全公钥 %1$lld 个 · 仍为存根 %2$lld 个

# yubikey_import_completion_issue_keyserver_fetch_failed
source: Could not complete public keys from keyservers.
ar: لا يمكن إكمال المفاتيح العامة من خوادم المفاتيح.
de: Öffentliche Schlüssel von Schlüsselservern konnten nicht vervollständigt werden.
es: No se pudieron completar las claves públicas de los servidores de claves.
fr: Impossible de compléter les clés publiques des serveurs de clés.
hi: कीसर्वर से सार्वजनिक कुंजियाँ पूर्ण नहीं हो सकीं।
ja: キーサーバーからの公開キーを完了できませんでした。
ko: 키서버에서 공개 키를 완료할 수 없습니다.
pt_br: Não foi possível concluir as chaves públicas dos servidores de chaves.
ru: Не удалось получить открытые ключи с серверов ключей.
zh_hans: 无法通过 keyserver 补全公钥。

# yubikey_import_completion_issue_keyserver_unreachable
source: Configured keyservers are unreachable (offline or network issue).
ar: لا يمكن الوصول إلى خوادم المفاتيح التي تم تكوينها (غير متصل أو مشكلة في الشبكة).
de: Konfigurierte Schlüsselserver sind nicht erreichbar (Offline- oder Netzwerkproblem).
es: No se puede acceder a los servidores de claves configurados (problema sin conexión o de red).
fr: Les serveurs de clés configurés sont inaccessibles (problème hors ligne ou réseau).
hi: कॉन्फ़िगर किए गए कुंजीसर्वर पहुंच योग्य नहीं हैं (ऑफ़लाइन या नेटवर्क समस्या)।
ja: 構成されたキーサーバーに到達できません (オフラインまたはネットワークの問題)。
ko: 구성된 키 서버에 연결할 수 없습니다(오프라인 또는 네트워크 문제).
pt_br: Os servidores de chaves configurados estão inacessíveis (problema off-line ou de rede).
ru: Настроенные серверы ключей недоступны (ошибка в автономном режиме или в сети).
zh_hans: 已配置 keyserver 不可达（离线或网络异常）。

# yubikey_import_completion_issue_missing_public_key_url
source: Card has no public key URL configured.
ar: لا تحتوي البطاقة على عنوان URL للمفتاح العام الذي تم تكوينه.
de: Für die Karte ist keine öffentliche Schlüssel-URL konfiguriert.
es: La tarjeta no tiene configurada una URL de clave pública.
fr: La carte n'a pas d'URL de clé publique configurée.
hi: कार्ड में कोई सार्वजनिक कुंजी URL कॉन्फ़िगर नहीं है.
ja: カードには公開キー URL が設定されていません。
ko: 카드에 구성된 공개 키 URL이 없습니다.
pt_br: O cartão não possui URL de chave pública configurado.
ru: Для карты не настроен URL-адрес открытого ключа.
zh_hans: 智能卡未配置公钥 URL。

# yubikey_import_completion_issue_url_fetch_failed
source: Failed to fetch from card URL.
ar: فشل الجلب من عنوان URL للبطاقة.
de: Das Abrufen von der Karten-URL ist fehlgeschlagen.
es: No se pudo recuperar la URL de la tarjeta.
fr: Échec de la récupération à partir de l'URL de la carte.
hi: कार्ड यूआरएल से लाने में विफल.
ja: カード URL からの取得に失敗しました。
ko: 카드 URL에서 가져오지 못했습니다.
pt_br: Falha ao buscar o URL do cartão.
ru: Не удалось получить данные с URL-адреса карты.
zh_hans: 从卡内 URL 获取失败。

# yubikey_import_completion_keyserver_used
source: Fetched via keyserver: %1$@
ar: تم الجلب عبر خادم المفاتيح: %1$@
de: Abgerufen über den Schlüsselserver: %1$@
es: Obtenido a través del servidor de claves: %1$@
fr: Récupéré via le serveur de clés : %1$@
hi: कीसर्वर के माध्यम से प्राप्त किया गया: %1$@
ja: キーサーバー経由で取得: %1$@
ko: 키서버를 통해 가져옴: %1$@
pt_br: Obtido via servidor de chaves: %1$@
ru: Получено через сервер ключей: %1$@.
zh_hans: 通过 keyserver 获取：%1$@

# yubikey_import_completion_partial_title
source: Public key completion partially succeeded
ar: نجح إكمال المفتاح العام جزئيًا
de: Die Vervollständigung des öffentlichen Schlüssels war teilweise erfolgreich
es: La finalización de la clave pública fue parcialmente exitosa
fr: L'achèvement de la clé publique a été partiellement réussi
hi: सार्वजनिक कुंजी पूर्ण करना आंशिक रूप से सफल हुआ
ja: 公開キーの完了が部分的に成功しました
ko: 공개 키 완성이 부분적으로 성공함
pt_br: Conclusão da chave pública parcialmente bem-sucedida
ru: Завершение открытого ключа частично удалось
zh_hans: 公钥补全部分成功

# yubikey_import_completion_stub_only_title
source: Only stubs imported
ar: بذرة مستوردة فقط
de: Es werden nur Stubs importiert
es: Solo se importan talones
fr: Uniquement les talons importés
hi: केवल स्टब्स का आयात किया गया
ja: スタブのみがインポートされる
ko: 스텁만 가져옴
pt_br: Somente stubs importados
ru: Импортированы только заглушки
zh_hans: 仅导入存根

# yubikey_import_description
source: Detect an inserted smartcard, fetch OpenPGP shadow stubs, and try to auto-import public keys from the card URL.
ar: اكتشف البطاقة الذكية المُدرجة، واجلب كعب ظل OpenPGP، وحاول استيراد المفاتيح العامة تلقائيًا من عنوان URL للبطاقة.
de: Erkennen Sie eine eingelegte Smartcard, rufen Sie OpenPGP-Shadow-Stubs ab und versuchen Sie, öffentliche Schlüssel automatisch von der Karten-URL zu importieren.
es: Detecte una tarjeta inteligente insertada, obtenga apéndices ocultos de OpenPGP e intente importar automáticamente claves públicas desde la URL de la tarjeta.
fr: Détectez une carte à puce insérée, récupérez les talons fantômes OpenPGP et essayez d'importer automatiquement les clés publiques à partir de l'URL de la carte.
hi: डाले गए स्मार्टकार्ड का पता लगाएं, ओपनपीजीपी छाया स्टब्स लाएं, और कार्ड यूआरएल से सार्वजनिक कुंजी को स्वचालित रूप से आयात करने का प्रयास करें।
ja: 挿入されたスマートカードを検出し、OpenPGP シャドウ スタブを取得し、カード URL から公開キーの自動インポートを試みます。
ko: 삽입된 스마트 카드를 감지하고, OpenPGP 섀도우 스텁을 가져오고, 카드 URL에서 공개 키 자동 가져오기를 시도합니다.
pt_br: Detecte um smartcard inserido, busque shadow stubs do OpenPGP e tente importar automaticamente as chaves públicas do URL do cartão.
ru: Обнаружьте вставленную смарт-карту, получите теневые заглушки OpenPGP и попытайтесь автоматически импортировать открытые ключи из URL-адреса карты.
zh_hans: 检测已插入智能卡，获取 OpenPGP 存根，并尝试从卡内公钥 URL 自动导入公钥。

# yubikey_import_email_unavailable
source: (Email unavailable)
ar: (البريد الإلكتروني غير متوفر)
de: (E-Mail nicht verfügbar)
es: (Correo electrónico no disponible)
fr: (E-mail indisponible)
hi: (ईमेल अनुपलब्ध)
ja: (メールはご利用いただけません)
ko: (이메일 불가)
pt_br: (E-mail indisponível)
ru: (Электронная почта недоступна)
zh_hans: （邮箱不可用）

# yubikey_import_in_progress
source: Detecting card, fetching stubs, and completing public keys...
ar: الكشف عن البطاقة، وجلب كعب الروتين، واستكمال المفاتيح العامة...
de: Karte erkennen, Stubs abrufen und öffentliche Schlüssel vervollständigen ...
es: Detectar tarjetas, recuperar talones y completar claves públicas...
fr: Détecter la carte, récupérer les talons et compléter les clés publiques...
hi: कार्ड का पता लगाना, स्टब्स लाना, और सार्वजनिक कुंजियाँ पूर्ण करना...
ja: カードを検出し、スタブを取得し、公開キーを完成させます...
ko: 카드 감지, 스텁 가져오기, 공개 키 완성...
pt_br: Detectando cartão, buscando stubs e completando chaves públicas...
ru: Обнаружение карты, получение заглушек и заполнение открытых ключей...
zh_hans: 正在检测设备、获取存根并补全公钥...

# yubikey_import_info_hint
source: If card URL import fails or is missing, import the public key manually (From File or From Keyserver).
ar: إذا فشل استيراد عنوان URL للبطاقة أو كان مفقودًا، فاستورد المفتاح العام يدويًا (من ملف أو من خادم المفاتيح).
de: Wenn der Import der Karten-URL fehlschlägt oder fehlt, importieren Sie den öffentlichen Schlüssel manuell (aus Datei oder vom Schlüsselserver).
es: Si la importación de la URL de la tarjeta falla o falta, importe la clave pública manualmente (desde archivo o desde servidor de claves).
fr: Si l'importation de l'URL de la carte échoue ou est manquante, importez la clé publique manuellement (à partir d'un fichier ou à partir d'un serveur de clés).
hi: यदि कार्ड यूआरएल आयात विफल हो जाता है या गायब है, तो सार्वजनिक कुंजी को मैन्युअल रूप से आयात करें (फ़ाइल से या कीसर्वर से)।
ja: カード URL のインポートが失敗するか、カード URL が見つからない場合は、公開キーを手動でインポートします (ファイルからまたはキーサーバーから)。
ko: 카드 URL 가져오기에 실패하거나 누락된 경우 공개 키를 수동으로 가져오세요(파일에서 또는 키서버에서).
pt_br: Se a importação do URL do cartão falhar ou estiver faltando, importe a chave pública manualmente (Do arquivo ou Do servidor de chaves).
ru: Если импорт URL-адреса карты не удался или отсутствует, импортируйте открытый ключ вручную (из файла или с сервера ключей).
zh_hans: 如果卡内 URL 导入失败或未配置，请手动导入公钥（From File 或 From Keyserver）。

# yubikey_import_manual_pubkey_required
source: Your SmartCard public key URL is missing or auto-download failed. Please import the public key manually (From File or From Keyserver); the SmartCard key will appear in the list after the public key is imported.
ar: عنوان URL للمفتاح العام لبطاقة SmartCard مفقود أو فشل التنزيل التلقائي. الرجاء استيراد المفتاح العام يدويًا (من ملف أو من خادم المفاتيح)؛ سيظهر مفتاح SmartCard في القائمة بعد استيراد المفتاح العام.
de: Die URL Ihres öffentlichen SmartCard-Schlüssels fehlt oder der automatische Download ist fehlgeschlagen. Bitte importieren Sie den öffentlichen Schlüssel manuell (aus Datei oder vom Schlüsselserver). Der SmartCard-Schlüssel erscheint in der Liste, nachdem der öffentliche Schlüssel importiert wurde.
es: Falta la URL de la clave pública de su SmartCard o falló la descarga automática. Importe la clave pública manualmente (desde archivo o desde servidor de claves); la clave SmartCard aparecerá en la lista después de importar la clave pública.
fr: L'URL de votre clé publique SmartCard est manquante ou le téléchargement automatique a échoué. Veuillez importer la clé publique manuellement (à partir d'un fichier ou à partir d'un serveur de clés) ; la clé SmartCard apparaîtra dans la liste après l'importation de la clé publique.
hi: आपका स्मार्टकार्ड सार्वजनिक कुंजी यूआरएल गुम है या ऑटो-डाउनलोड विफल रहा है। कृपया सार्वजनिक कुंजी को मैन्युअल रूप से आयात करें (फ़ाइल से या कीसर्वर से); सार्वजनिक कुंजी आयात होने के बाद स्मार्टकार्ड कुंजी सूची में दिखाई देगी।
ja: SmartCard 公開キー URL が見つからないか、自動ダウンロードに失敗しました。公開キーを手動でインポートしてください (ファイルからまたはキーサーバーから)。公開キーがインポートされた後、SmartCard キーがリストに表示されます。
ko: 스마트카드 공개 키 URL이 누락되었거나 자동 다운로드에 실패했습니다. 공개 키를 수동으로 가져오십시오(파일에서 또는 키 서버에서). 공개 키를 가져온 후 SmartCard 키가 목록에 나타납니다.
pt_br: O URL da chave pública do seu SmartCard está faltando ou o download automático falhou. Importe a chave pública manualmente (do arquivo ou do servidor de chaves); a chave do SmartCard aparecerá na lista após a importação da chave pública.
ru: URL-адрес открытого ключа вашей смарт-карты отсутствует или не удалось выполнить автоматическую загрузку. Пожалуйста, импортируйте открытый ключ вручную (из файла или с сервера ключей); Ключ смарт-карты появится в списке после импорта открытого ключа.
zh_hans: 您的 SmartCard pub key URL 未定义或自动下载失败。请手动导入 pub key（From File 或 From Keyserver）后，SmartCard key 才会显示在列表中。

# yubikey_import_name_unavailable
source: (Name unavailable)
ar: (الاسم غير متوفر)
de: (Name nicht verfügbar)
es: (Nombre no disponible)
fr: (Nom indisponible)
hi: (नाम अनुपलब्ध)
ja: (名前は不明)
ko: (이름을 알 수 없음)
pt_br: (Nome indisponível)
ru: (Имя недоступно)
zh_hans: （名称不可用）

# yubikey_import_result_card_serial
source: Card %1$@
ar: بطاقة %1$@
de: Karte %1$@
es: Tarjeta %1$@
fr: Carte %1$@
hi: कार्ड %1$@
ja: カード %1$@
ko: 카드 %1$@
pt_br: Cartão %1$@
ru: Карта %1$@
zh_hans: 卡号 %1$@

# yubikey_import_result_existing_stubs
source: No new stubs were fetched. Detected %1$lld existing stubs for this card.
ar: لم يتم جلب أي عناصر stub جديدة. تم اكتشاف %1$lld عناصر stub موجودة لهذه البطاقة.
de: Es wurden keine neuen Stubs abgerufen. %1$lld vorhandene Stubs für diese Karte erkannt.
es: No se recuperaron nuevos talones. Se detectaron %1$lld talones existentes para esta tarjeta.
fr: Aucun nouveau talon n'a été récupéré. Stubs existants %1$lld détectés pour cette carte.
hi: कोई नया स्टब नहीं लाया गया। इस कार्ड के लिए %1$lld मौजूदा स्टब्स का पता लगाया गया।
ja: 新しいスタブは取得されませんでした。このカードの %1$lld 既存のスタブが検出されました。
ko: 새로운 스텁을 가져오지 않았습니다. 이 카드에 대한 기존 스텁 %1$lld가 감지되었습니다.
pt_br: Nenhum novo stub foi obtido. Detectados stubs %1$lld existentes para esta placa.
ru: Новых заглушек получено не было. Обнаружены существующие заглушки %1$lld для этой карты.
zh_hans: 未获取到新的存根，已检测到该卡现有存根 %1$lld 个。

# yubikey_import_result_more_items
source: +%1$lld more
ar: +%1$lld المزيد
de: +%1$lld mehr
es: +%1$lld más
fr: +%1$lld plus
hi: +%1$lld अधिक
ja: +%1$lld もっと見る
ko: +%1$lld 더보기
pt_br: +%1$lld mais
ru: +%1$lld ещё
zh_hans: 还有 %1$lld 项

# yubikey_import_result_no_stubs
source: No new stubs were added. Import matching public keys first if needed.
ar: لم تتم إضافة أي بذرة جديدة. قم باستيراد المفاتيح العامة المطابقة أولاً إذا لزم الأمر.
de: Es wurden keine neuen Stubs hinzugefügt. Importieren Sie bei Bedarf zuerst passende öffentliche Schlüssel.
es: No se agregaron nuevos talones. Importe primero las claves públicas coincidentes si es necesario.
fr: Aucun nouveau talon n'a été ajouté. Importez d’abord les clés publiques correspondantes si nécessaire.
hi: कोई नया स्टब नहीं जोड़ा गया. यदि आवश्यक हो तो पहले मेल खाने वाली सार्वजनिक कुंजियाँ आयात करें।
ja: 新しいスタブは追加されませんでした。必要に応じて、最初に一致する公開キーをインポートします。
ko: 새로운 스텁이 추가되지 않았습니다. 필요한 경우 일치하는 공개 키를 먼저 가져옵니다.
pt_br: Nenhum novo stub foi adicionado. Importe primeiro as chaves públicas correspondentes, se necessário.
ru: Новых заглушек не добавлялось. При необходимости сначала импортируйте соответствующие открытые ключи.
zh_hans: 未新增存根。如有需要，请先导入对应公钥。

# yubikey_import_result_summary
source: %1$lld stubs fetched · Card %2$@
ar: تم جلب بذرة %1$lld · بطاقة %2$@
de: %1$lld Stubs abgerufen · Karte %2$@
es: %1$lld talones recuperados · Tarjeta %2$@
fr: Talons %1$lld récupérés · Carte %2$@
hi: %1$lld स्टब्स लाए गए · कार्ड %2$@
ja: %1$lld フェッチされたスタブ · カード %2$@
ko: %1$lld 스텁을 가져왔습니다. · 카드 %2$@
pt_br: Stubs %1$lld obtidos · Cartão %2$@
ru: %1$lld получены незавершенные сообщения · Карточка %2$@
zh_hans: %1$lld 个存根已获取 · 卡号 %2$@

# yubikey_import_result_title
source: Fetched YubiKey stubs
ar: تم جلب بذرة YubiKey
de: YubiKey-Stubs abgerufen
es: Talones de YubiKey recuperados
fr: Stubs YubiKey récupérés
hi: YubiKey स्टब्स प्राप्त किए
ja: 取得した YubiKey スタブ
ko: 가져온 YubiKey 스텁
pt_br: Stubs YubiKey buscados
ru: Получены заглушки YubiKey.
zh_hans: 已获取的 YubiKey 存根

# yubikey_pin_empty_error
source: PIN is required
ar: مطلوب رقم التعريف الشخصي
de: PIN ist erforderlich
es: Se requiere PIN
fr: Le code PIN est requis
hi: पिन आवश्यक है
ja: PINが必要です
ko: PIN이 필요합니다
pt_br: O PIN é obrigatório
ru: Требуется PIN-код
zh_hans: 请输入 PIN

# yubikey_pin_field_label
source: YubiKey PIN
ar: رقم التعريف الشخصي لمفتاح يوبيكي
es: PIN de la clave Yubi
fr: Code PIN YubiKey
hi: यूबीकी पिन
ko: 유비키 PIN
pt_br: PIN YubiKey
ru: ЮбиКей ПИН-код
zh_hans: YubiKey PIN 码

# yubikey_pin_placeholder
source: Enter PIN
ar: أدخل رقم التعريف الشخصي
de: PIN eingeben
es: Introducir PIN
fr: Entrez le code PIN
hi: पिन दर्ज करें
ja: PINを入力してください
ko: PIN 입력
pt_br: Insira o PIN
ru: Введите PIN-код
zh_hans: 输入 PIN

# yubikey_pin_subtitle
source: Enter your YubiKey PIN to continue this operation.
ar: أدخل رقم التعريف الشخصي (PIN) الخاص بـ YubiKey لمواصلة هذه العملية.
de: Geben Sie Ihre YubiKey-PIN ein, um diesen Vorgang fortzusetzen.
es: Ingrese su PIN de YubiKey para continuar con esta operación.
fr: Saisissez votre code PIN YubiKey pour poursuivre cette opération.
hi: इस ऑपरेशन को जारी रखने के लिए अपना YubiKey पिन दर्ज करें।
ja: この操作を続行するには、YubiKey PIN を入力してください。
ko: 이 작업을 계속하려면 YubiKey PIN을 입력하세요.
pt_br: Digite seu PIN YubiKey para continuar esta operação.
ru: Введите PIN-код YubiKey, чтобы продолжить эту операцию.
zh_hans: 请输入 YubiKey PIN 以继续该操作。

# yubikey_pin_title
source: YubiKey PIN
ar: رقم التعريف الشخصي لمفتاح يوبيكي
es: PIN de la clave Yubi
fr: Code PIN YubiKey
hi: यूबीकी पिन
ko: 유비키 PIN
pt_br: PIN YubiKey
ru: ЮбиКей ПИН-код
zh_hans: YubiKey PIN 码

# setting_language_option_arabic
source: العربية
de: Arabisch
es: árabe
fr: arabe
hi: अरबी
ja: アラビア語
ko: 아라비아 말
pt_br: árabe
ru: арабский

# action_export_ownertrust
source: Export Ownertrust
zh_hans: 导出信任分配

# action_generate_revocation_certificate
source: Generate Revocation Certificate
zh_hans: 生成撤销证书

# action_import_ownertrust
source: Import Ownertrust
zh_hans: 导入信任分配

# action_import_revocation_certificate
source: Import Revocation Certificate
zh_hans: 导入撤销证书

# action_manage_revocation
source: Revocation Center
zh_hans: 撤销中心

# action_ownertrust_transfer
source: Ownertrust Transfer
zh_hans: 信任分配迁移

# ownertrust_export_success_message
source: Ownertrust exported successfully
zh_hans: 信任分配已成功导出

# ownertrust_import_success_message
source: Ownertrust imported successfully
zh_hans: 信任分配已成功导入

# ownertrust_transfer_export_description
source: Export current ownertrust records to a file for backup or migration.
zh_hans: 将当前 ownertrust 记录导出到文件，用于备份或迁移。

# ownertrust_transfer_import_description
source: Import ownertrust records from a file and refresh trust calculations.
zh_hans: 从文件导入 ownertrust 记录并刷新信任计算。

# ownertrust_transfer_subtitle
source: Export or import trust assignments across keyrings
zh_hans: 在不同密钥环之间导入或导出信任分配

# ownertrust_transfer_title
source: Ownertrust Transfer
zh_hans: 信任分配迁移

# revocation_center_subtitle
source: Generate and import revocation certificates
zh_hans: 生成并导入撤销证书

# revocation_center_title
source: Revocation Center
zh_hans: 撤销中心

# revocation_description_placeholder
source: Optional explanation (shown in certificate)
zh_hans: 可选说明（将写入证书）

# revocation_import_success_message
source: Revocation certificate imported successfully
zh_hans: 撤销证书已成功导入

# revocation_passphrase_placeholder
source: Passphrase (leave empty if not required)
zh_hans: 口令（如无可留空）

# revocation_reason_key_compromised
source: Key has been compromised
zh_hans: 密钥已泄露

# revocation_reason_key_replaced
source: Key has been replaced
zh_hans: 密钥已替换

# revocation_reason_no_longer_used
source: No longer used
zh_hans: 不再使用

# revocation_reason_title
source: Revocation Reason
zh_hans: 撤销原因

# revocation_reason_user_id_invalid
source: User ID is no longer valid
zh_hans: 用户标识不再有效

# revocation_success_message
source: Revocation certificate generated successfully
zh_hans: 撤销证书已成功生成

# setting_enable_key_signing
source: Enable key signing in key menu
zh_hans: 在密钥菜单中启用密钥签名
